<template>
  <div class="agreement">
    <com-header></com-header>
    <div>欢迎您来到拼任务(微信公众号名称为拼任务君、微信小程序名称为任务君) （以下简称“本软件”）</div></br>
    <div>请您务必审慎阅读、充分理解协议中相关条款内容。如果您对本协议的任何条款表示异议，请您立即停止注册及使用本软件所提供的全部服务。当您注册成功，无论是进入，还是在本软件上发布任何内容，使用本软件任何功能，均意味着您（即「用户」）完全接受本协议项下的全部条款。</div></br>
    <div>一、 接受条款</div>
    <div>1、本软件的运营者及相关关联公司根据本协议的条款及不定期发布的规则为您提供基于本软件（包括网站、手机客户端、移动网页端等）的互联网服务。根据国家法律法规变化及本软件运营需要，本软件有权对本协议条款及相关规则不时地进行修改，修改后的内容一旦以任何形式公布在本软件上即生效，并取代此前相关内容，您应不时关注本软件公告、提示信息及协议、规则等相关内容的变动。您知悉并确认，如您不同意更新后的内容，应立即停止使用本软件；如您继续使用本软件，即视为知悉变动内容并同意接受。</div></br>
    <div>2、您应遵守本协议的各项条款，合法合理使用本软件提供的服务，否则，本软件有权依据本协议中断或终止为您提供服务。同时，本软件保留在任何时候收回您所使用的账号的权利。</div></br>
    <div>二、 服务内容</div>
    <div>本软件向注册用户发放市场调查问卷、图片/语音/视频/文字采集小任务及其他相关活动，用户通过参与以上服务内容获得金币奖励，累计金币奖励可以兑换虚拟或实物奖品。用户可通过登录本软件参与问卷调查，亦可通过电话、Email、手机短信、微信等第三方软件的方式参与本软件提供的服务。</div></br>
    <div> 基于本软件所提供的服务，您确认并同意：</div></br>
    <div>1、提供的注册资料真实、准确、完整、合法有效，注册资料如有变动的，应及时更新；</div></br>
    <div>2、用户须对注册信息的真实性、合法性、有效性承担全部责任，用户不得冒充他人；不得利用他人的名义发布任何信息。如果您提供的注册资料不合法、不真实、不准确、不详尽的，您需承担因此引起的相应责任及后果，并且我们保留终止您使用本软件各项服务的权利。</div></br>
    <div>三、 用户个人信息保护及授权</div>
    <div>1、您知悉并同意，为方便您使用本软件的服务，本软件将存储如下可能的必要信息，包括但不限于您的真实姓名、性别、生日、身份证、居住地址、手机号码、邮箱、定位信息以及其他用于市场调研的个人信息。本软件利用合理措施保障用户个人信息的安全。</div></br>
    <div>2、您在使用本软件某一特定服务时，该服务可能会另有单独的协议、相关业务规则等（以下统称为“单独协议”），您在使用该项服务前请阅读并同意相关的单独协议；您使用前述特定服务，即视为您已阅读并同意接受相关单独协议</div></br>
    <div>3、您充分理解并同意：</div></br>
    <div>（1）接收通过邮件、短信、电话、APP 消息、微信消息等形式，向本软件用户发送通知、邀请等信息；</div></br>
    <div>（2）为配合行政监管机关、司法机关执行工作，在法律规定范围内我们有权向上述行政、司法机关提供您在使用本软件时所储存的相关信息，包括但不限于您的注册信息等，或使用相关信息进行证据保全，包括但不限于公证、见证等；</div></br>
    <div>（3）依法保障您在安装或使用过程中的知情权和选择权，在您使用本软件服务过程中，涉及您设备自带功能的服务会提前征得您同意，您一经确认，本软件有权开启包括但不限于收集地理位置、使用摄像头/相册、启用录音等提供服务必要的辅助功能。</div></br>
    <div>（4）本软件有权根据实际情况，在法律规定范围内自行决定单个用户在本软件及服务中数据的最长储存期限以及用户日志的储存期限，并在服务器上为其分配数据最大存储空间等。</div></br>
    <div>四、 用户行为规范</div>
    <div>1、您应遵守中华人民共和国相关法律法规，并同意对以任何方式使用您的登录账号而使用本服务的任何行为及其结果承担全部责任。如您的行为违反国家法律，您将依法承担全部法律责任；如涉嫌构成犯罪，司法机关将追究您的刑事责任，本软件将严格按照法律规定的义务及司法机关的要求进行配合。 同时，如果本软件有理由认为您的任何行为，包括但不限于您的任何言论或其它行为违反或可能违反国家法律法规的任何规定，本软件可在任何时候不经任何事先通知终止向您提供服务。</div></br>
    <div>2、您同意将不会利用本服务进行任何违法或不正当的活动，包括但不限于下列行为：</div></br>
    <div>（1）反对宪法所确定的基本原则的;</div></br>
    <div>（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的;</div></br>
    <div>（3）损害国家荣誉和利益的;</div></br>
    <div>（4）煽动民族仇恨、民族歧视、破坏民族团结的；</div></br>
    <div>（5）破坏国家宗教政策，宣扬邪教和封建迷信的；</div></br>
    <div>（6）散布谣言，扰乱社会秩序，破坏社会稳定的；</div></br>
    <div>（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</div></br>
    <div>（8）侮辱或者诽谤他人，侵害他人合法权利的；</div></br>
    <div>（9）含有虚假、诈骗、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其他道德上令人反感的内容；</div></br>
    <div>（10）含有中国法律、法规、（部门）规章以及任何具有法律效力之规范所限制或禁止的其他内容的；</div></br>
    <div>3、保密要求：</div></br>
    <div>用户必须遵守市场调查内容保密原则。保密内容包括但不限于问卷中的题目，图形，影音，素材等全部问卷信息。严禁复制、打印、拍照、录音录像等物理或电子手段的收集、存储和传播行为出现；严禁任何形式的发布、转发等传播行为出现；禁止任何泄露问卷内容的行为出现，一旦发现我们有权追究您的法律责任。</div></br>
    <div>五、 免责申明</div>
    <div>1、用户在本软件发表的内容仅表明其个人的立场和观点，并不代表本软件的立场或观点。作为内容的发表者，需自行对所发表内容负责，因所发表内容引发的一切纠纷，由该内容的发表者承担全部法律及连带责任。本软件不承担任何法律及连带责任。</div></br>
    <div>2、本软件不保证网络服务一定能满足用户的要求，也不保证网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作保证。</div></br>
    <div>3、对于因不可抗力或本软件不能控制的原因造成的网络服务中断或其它缺陷，我们不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。</div></br>
    <div>六、 法律管辖适用及其他</div>
    <div>本协议及您与本软件之关系，均适用中华人民共和国法律。您与本软件就本服务、本协议或其他有关事项发生的争议，应首先友好协商解决，协商不成时应提请本软件实际运营者所在地有管辖权的人民法院通过诉讼解决。</div></br>
    <div class="btn" @click="goBack">我知道了</div>
  </div>
</template>

<script>
import Login from "./common/Login";

export default {
  name: "agree",
  methods: {
    goBack() {
      this.$router.back();
    }
  }
};
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped lang="scss">
@mixin size($w: 100%, $h: 100px) {
  width: $w;
  height: $h;
}

.agreement {
  padding: 90px 7% 0;
  line-height: 25px;
  div {
    font-size: 14px;
    text-align: left;
  }
  .btn {
    margin: 20px auto;
    text-align: center;
    @include size(200px, 50px);
    line-height: 50px;
    border-radius: 6px;
    background: #7575f9;
    font-size: 16px;
    color: #fff;
    cursor: pointer;
  }
  h3 {
    margin: 3px auto;
    text-align: center;
  }
  div::-moz-selection {
    background: #7575f9;
  }
  div::selection {
    background: #7575f9;
  }
  p::-moz-selection {
    background: #7575f9;
  }
  p::selection {
    background: #7575f9;
  }
  h3::-moz-selection {
    background: #7575f9;
  }
  h3::selection {
    background: #7575f9;
  }
}
</style>
